// var sleep = require( 'sleep' );
// 数组删除
Array.prototype.remove = function (val) {
    var index = this.indexOf(val);
    if (index > -1) {
        this.splice(index, 1);
    }
};
const Ming = {
    六十甲子: ["甲子", "乙丑", "丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉", "甲戌", "乙亥", "丙子", "丁丑", "戊寅", "己卯", "庚辰", "辛巳", "壬午", "癸未", "甲申", "乙酉", "丙戌", "丁亥", "戊子", "己丑", "庚寅", "辛卯", "壬辰", "癸巳", "甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥", "庚子", "辛丑", "壬寅", "癸卯", "甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥", "壬子", "癸丑", "甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌", "癸亥"],
    四天干: "", 四地支: "", 六十甲子_逆: [], 甲子180个: [], 甲子180个_逆: [], 四柱: [], 流年: [], 大运: [], 岁: 0, 顺排: false, birthYear : 0, 
    init(bornYear, bazi, sex, age) {
        this.甲子180个 = this.六十甲子.concat(this.六十甲子).concat(this.六十甲子);
        this.甲子180个_逆 = [...this.甲子180个]; this.甲子180个_逆.reverse();
        this.六十甲子_逆 = [...this.六十甲子]; this.六十甲子_逆.reverse();
        this.birthYear = bornYear; 
        this.getSiZhu(bazi); this.getLiuNian(bornYear); this.getDaYun(sex, age, bornYear);
        this.callbacks.forEach(x => x(this));
    },
    getSiZhu(bazi) {     //分割参数,得到四柱数组 getSiZhu("戊午,壬戌,庚寅,戊寅")

        this.四柱 = bazi.split(',');
        SizhuStr = this.四柱.join("");
        Sizhu2Str = SizhuStr.split('');
        this.四天干 = Sizhu2Str[0] + Sizhu2Str[2] + Sizhu2Str[4] + Sizhu2Str[6];
        this.四地支 = Sizhu2Str[1] + Sizhu2Str[3] + Sizhu2Str[5] + Sizhu2Str[7];
    },
    getLiuNian(bornYear) {       //循环得到流年数组 getLiuNian(1978)
        var nian = (this.六十甲子).indexOf(this.四柱[0]);
        var _bornYear = bornYear;
        for (let index = nian; index < nian + 100; index++) {
            var ob = {}; ob[this.甲子180个[index]] = _bornYear;
            this.流年.push(ob);
// console.log(ob);
            _bornYear++;
        }
    },
    getDaYun(sex, age, bornYear) {
        this.getShunNie(sex);   //获取顺排逆排
        let jia180 = this.甲子180个;
        let yueZhu_pos = (this.六十甲子).indexOf(this.四柱[1]);
        if (!this.顺排) {
            jia180 = this.甲子180个_逆;  //选择顺逆的甲子数组
            yueZhu_pos = (this.六十甲子_逆).indexOf(this.四柱[1]);
        }

        var ten = 10, forIdx = 0; //设置循环大运的参数
        for (let index = yueZhu_pos + 1; index < yueZhu_pos + 8; index++) {
            var age2 = age + (ten * forIdx);
            var ob = {};
            ob[jia180[index]] = age2 + "-" + (age2 + ten - 1) + "," + (age2 + bornYear);
            this.大运.push(ob);
            forIdx++;
// console.log(ob);      
        }
    },
    getShunNie(sex) {
        var nian = (this.六十甲子).indexOf(this.四柱[0]);
        if (nian % 2 === 0 && sex == "男") this.顺排 = true;
        if (nian % 2 !== 0 && sex == "女") this.顺排 = true;
    },
    Is天克地_冲(arr四干支,arr大运干支,arr流年干支){ //可以删除  是否是三合局
        //甲庚,乙辛,丙壬,丁癸
        //子午,丑未
        let result = "";
        let dichong = ["子午","丑未","寅申","卯酉","辰戌","巳亥","午子","未丑","申寅","酉卯","戌辰","亥巳"];
        let tianke =  ["甲戊","乙己","丙庚","丁辛","戊壬","己癸","庚甲","辛乙","壬丙","癸丁","戊甲","己乙","庚丙","辛丁","壬戊","癸己","甲庚","乙辛","丙壬","丁癸"];
        let arrGan = [],arrZhi = [];
        arrGan.push(arr大运干支[0]+arr流年干支[0]); //干+干  //甲子,乙丑
        arrZhi.push(arr大运干支[1]+arr流年干支[1]); //支+支
        arr四干支.forEach(x => {
            str干 = x.split('')[0];
            str支 = x.split('')[1];
            arrGan.push(arr大运干支[0] + str干); //干+干
            arrZhi.push(arr大运干支[1] + str支); //支+支
            arrGan.push(arr流年干支[0] + str干); //干+干
            arrZhi.push(arr流年干支[1] + str支); //支+支
        } );
        for (let i = 0; i < arrGan.length; i++) {
            rt =`${arrGan[i]} - ${arrZhi[i]}`;
            // console.log(rt);//4
            if(tianke.includes(arrGan[i]) && dichong.includes(arrZhi[i])){
                let ganzhi1 = arrGan[i].split('')[0] + arrZhi[i].split('')[0];
                let ganzhi2 = arrGan[i].split('')[1] + arrZhi[i].split('')[1];
                result = `天克地冲:${ganzhi1} - ${ganzhi2}`
                // console.log(`\t天克地冲:${ganzhi1} - ${ganzhi2}`);
            };
        }
        return result;
    },
    Is合局(str四地支,str大运支,str流年支,JU){ //是否是三合或者三会局
        let rt = "";
        let SanJu = JU.JuArr;// 三合或者三会局 ["寅午戌", "申子辰", "亥卯未", "巳酉丑"];
        let SanJu_son = "";
        for (let i = 0; i < SanJu.length; i++) { //大运查三合局,看是哪个和局
            if(SanJu[i].includes(str大运支)){SanJu_son = SanJu[i];break;}
        };
        SanJu_son = SanJu_son.replaceAll(str大运支,''); //剩下两个
        if(SanJu_son.includes(str流年支)){
            SanJu_son = SanJu_son.replaceAll(str流年支,'');
            if(str四地支.includes(SanJu_son)) {
                rt = `${JU.JuName}:${str大运支}${str流年支}${SanJu_son}`
                // console.log(`\t流年${JU.JuName}:大运${str大运支}`);
                // return true;//如果也存在,则三个交集成和局成立
            }
        }//else{ return false;}
        return rt;
    },
    Get日干查地支(Mingx,obj){
        let rt="";
        let 羊刃 = obj.Arr;
        let rizhu = Mingx.四柱[2]; //日柱
        let 四支 = Mingx.四地支;
        for (let i = 0; i < 羊刃.length; i++) {
            let yangrenson = 羊刃[i];
            if(yangrenson.includes(rizhu.split('')[0])){ //查日干
                if(四支.includes(羊刃[i].split('')[1])){  //查四柱地支
                    rt = `\n${obj.Name}:${rizhu.split('')[0]}${羊刃[i].split('')[1]}${obj.content}--------------------------------------------------------`;
                };
                break;
            };
        };
        return rt;
    },
    Get年支查余支(Mingx,obj){
        let rt="";
        let 数组 = obj.Arr;
        let zhu = Mingx.四柱[0]; //年柱
        let 四支 = Mingx.四地支;
        for (let i = 0; i < 数组.length; i++) {
            let item = 数组[i]; 
            let i2tem = item.split(",");    //"申子辰,寅"
            if(i2tem[0].includes(zhu.split('')[1])){ //查年支
                if(四支.substring(1).includes(i2tem[1])){  //查四柱地支
                    rt = `\n${obj.Name}:${zhu.split('')[1]}见${i2tem[1]}${obj.content}--------------------------------------------------------`;
                };
                break;
            };
        };
        return rt;
    },
    Get地支查余支(Mingx,obj){  //相刑
        let rt="";
        let 数组 = obj.Arr;
        let 四支 = Mingx.四地支;
        for (let i = 0; i < 数组.length; i++) {
            let item = 数组[i]; 
            let i2tem = item.split('');    
            if(四支.includes(i2tem[0])){ 
                if(四支.replace(i2tem[0],'').includes(i2tem[1])){  
                    rt += `\n${obj.Name}:${i2tem[0]}${i2tem[1]}相刑${obj.content}--------------------------------------------------------`;
                };
            };
        };
        return rt;
    },
    Get列出所有神煞(Mingx){
        let rt = `命盘：${Mingx.四柱}\n--------------------------------------------------------` ;
        // let 魁罡 = ["庚戌", "庚辰", "壬辰", "戊戌"];
        // if (魁罡.includes(Mingx.四柱[2])) { rt += `魁罡:${Mingx.四柱[2]}`;};

        /* 1.魁罡  */     
        let JU = { Name:"魁罡", Arr : ["庚戌", "庚辰", "壬辰", "戊戌"], content :"命带魁罡，命带魁罡的人在神煞中不常见，主人聪明，有野心、临事果断，秉权好杀，古时军人中较多见，主贵，但不宜做官" };
        if (JU.Arr.includes(Mingx.四柱[2])) { rt += `魁罡:${Mingx.四柱[2]}\n\t${JU.content}\n`;};

        /* 2.羊刃  */     
        JU = { Name:"羊刃", Arr : ["甲卯","乙寅","丙午","丁未","庚酉","辛申","壬子","癸亥"],
        content : `
        羊刃也称之为阳刃，以日元为主看地支，甲刃在卯，乙刃在寅,，丙戊刃在午， 丁己刃在未，庚刃在酉，辛刃在戌，壬刃在子，癸刃在丑。

        羊刃是四柱神煞之一，星命家所认为的极恶之煞。 羊刃者，本为司刑之特殊星，而此星之特征为激发、急躁。 但此暴戾的性情诱导，往往生出罕有之怪杰、烈士、孝妇等。 带此星者，从事警察的居多。

        如果原局羊刃见刑克，刃在何宫，何宫就会有损伤，如：年上羊刃，主破祖业；月上父母宫坐羊刃，性格偏激乖张，不利父母，手足无情；日支婚宫坐羊刃，主凶暴害物，亲近恶党，男命不论贵贱不论身旺弱，主一生婚姻多变；时上子女宫坐羊刃，主刑妻克子。羊刃虽为凶星，但也有好的一面，因羊刃与禄为同类，具有护身之功，身弱之人遇到羊刃，反主大吉，前提是在原局中刃不能遇到刑克。
        
        总的来说，羊刃主刚，对于日主有强大的生扶力量，且其加强力量的性能大于比劫，所以其带来的祸福也大于一般的比劫。羊刃是颗煞星，入贵格者少，身弱禄重有贵人相扶者无防，多出武将。

        普通人遇到，应避其凶的一面，如命带羊刃，则生性暴烈易冲动，易结死党，甚至有侵害他人的倾向；这样的人一定要严以律已，遵纪守法，压制冲动，不与作奸犯科之人为伍，多积德行善，培养良好的道德情操，就能趋吉避凶；人不是命中注定而没法改变的，后天的修炼行善积德是完全可以改变命运的。
        
        羊刃案例1：玄何师傅解析： 乙卯、戊寅、丙午、甲午 ；8岁起运：丁丑、丙子、乙亥、甲戌、癸酉、壬申、辛未、庚午 ；大溪水命人，每十年逢立冬之后第四天转运，现在甲戌大运中。

        丙火生于寅月得令，干支木、火成势，日时午火羊刃护身，八字以变格从旺论命，故而五行依然喜用木、火；忌土、金、水。

        男以财星代表异性缘分妻子，你八字四柱无财，天干不透、地支不藏，说明你异性缘分不深，难有长久稳定的感情；年月临空，故而难得父母兄弟的帮扶；加之日时坐羊刃，婚宫午午自刑克妻刑子之象明显，亦是婚姻多变之象，自己要多加注意才行。

        从你运势来看，早年一路丁丑、丙子、乙亥走忌神北方水旺之地破格，故而16岁未成年，就步入社会闯荡，一人在外漂泊无依多年，难求稳定的工作。
        十年一步运，2012年转入38至48岁现在的甲戌大运中，天干甲木透干，地支寅午戌三合婚姻宫，合为比劫局，故而与一个有过感情的二婚女人结婚。2014年甲午，岁运命三合子女宫动得子；然午午自刑，夫妻吵闹不断，感情严重失和。

        2015年乙未，流年合动日时午火羊刃，你的所作所为更令妻子心凉，届年妻子就已经，不想和你过了，婚姻名存实亡！去年丙申，今年丁酉，忌神财星当令，幸好有比劫喜神盖头克，不然你恐怕更加是凶多吉少，就不是赌债压身这么简单了。

        明年戊戌，生肖兔合太岁，六合火局大吉，届年收入会有所增加缓解压力，也有利于婚姻家庭，希望你能洗心革面，从新做人，不要让孩子长大了都恨你！
        2019年己亥，流年与命局相合，化忌为喜，生活平稳顺利；2020年庚子，忌神金水两旺，流年天克地冲婚姻宫和子女宫，切记要安分守己的做事做人，预防意外之灾伤妻害儿，更要防范牢狱之灾！届年一定要远离是非之地。

        2021年辛丑，不利财运婚姻，切不可冒然投资；48至58岁走癸酉大运，前五年戊癸化火，加之2022年至2026年木火旺，踏实肯干财运不会差，步入小康不成问题。后五年运支酉金主事，要注意自己或是妻子身体疾病破财，生活压力增大。
        58岁之后走壬申、辛未大运，依然是土金忌神之地，对你依然不利；一生与喜用神木火之运无缘，想发大财是不可能的，如不懂得珍惜当下，晚年很容易孤苦无依，生活困顿！

        \n` };
        rt += Mingx.Get日干查地支(Mingx,JU);

        /* 3.文昌贵人  */   
        JU = { Name:"文昌贵人", Arr : ["甲巳","乙午","丙申","丁酉","戊申","己酉","庚亥","辛子","壬寅","癸卯"] , 
        content :`
            文昌贵人主人聪明，文笔好，记性好，学东西能举一反三，并主秀气，外表斯文，给人一种温文尔雅而谦虚的感觉。八字命带文昌贵人的人学习好，有灵性，是读书的材料，气质雅秀，具上进心，一生近官近贵 \n`  };
        rt += Mingx.Get日干查地支(Mingx,JU);  
        
        /* 4.驿马  */ 
        JU = { Name:"驿马", Arr : ["申子辰,寅","寅午戌,申","巳酉丑,亥","亥卯未,巳"] , 
        content :`
        年支查四支，见之者为是 《三命钤》：驿马者之命中，发用喜庆之神也，若人遇之，君子常居荣位，小人亦主丰瞻，大小运行年至此，主得官及迁改之喜，若小运及行年太岁与驿马合并，主迁官得禄，如甲子人驿马在寅，小运及太岁至亥，亥与寅合之类也。\n`  };
        rt += Mingx.Get年支查余支(Mingx,JU); 

        /* 5.禄         */ 
        /* 6.三奇贵人   */
        JU = { Name:"三奇贵人", Arr : ["甲戊庚","乙丙丁","壬癸辛",] , 
        content :`
        三奇不论顺逆，只要连续三个天干相连，即可入格，重逢更贵。

        三奇的看法以日为主，必须按年干、月干、日干或月干、日干、时干的顺序依次排定，才算正确，位置颠倒则不对。运用三奇论贵还应注意，仅有三奇而不入格，也不应以贵论，并非三奇就以吉论。

        天上天奇甲戊庚者：以甲为日，以戊为月，以庚为星；既有日月星，地支须得戌亥为天门，方得为奇。若无戌亥，须有日月星而无天门，则不为奇矣。而有天门，若有丑卯酉已有不为奇。寅中有箕星好风，酉中有毕宿主雨，丑卯为风雷，则三光失明，奇不得时也。
        
        地下三奇乙丙丁者：乙木为阴木之魁，丙火为阳火之君，丁火为阴火之精，此地有之为奇。须用乙，乙属坤土，若无则不吉。

        人中三奇壬癸辛：​而“辛壬癸”三奇似乎与常见的“壬癸辛”三奇次序不同，但我们以为，地上三奇本来就是“辛壬癸”而非“壬癸辛”，这种排法在《秘藏大六壬大全》中也早有记载，故“壬癸辛”当是“辛壬癸”之误传。若在四柱中，理应壬水在中央，方不至背离三式之理，而且最好是壬水在日主之上。《珞琭子》曰：天干见辛壬癸之所以为奇，是因为天干连珠相生为妙也。。\n`  };
        rt += Mingx.Get年支查余支(Mingx,JU); 
        
        


        /* 7.伏吟      */
        /* 8.反吟      */
        content :`

        四柱地支与命局内或岁运地支相冲者，即是反吟，又作返吟，干支皆伏吟者，尤重，故又名天克地冲。如癸未日再见乙丑年。

        汪师傅批八字日记
        1）命局四柱内的反吟
        年柱与月柱反吟：中年以前有灾，破祖离家或出生寒微，刑克父祖辈，小时体弱难养。
        年柱与日柱反吟：易与长辈冲突，夫妻易克离，克子息，富贵不长久。
        年柱与时柱反吟：老年多灾厄，子息疏远，做事有始无终，不能贯彻始终，别立根基。时支再刑冲，婚前得子。
        月柱与日柱反吟：中年奔波劳苦有灾，六亲缘薄，配偶不和，夫妻宫不稳。
        月柱与时柱反吟：六亲不睦，多争吵，事业乖异不顺。
        日柱与时柱反吟：中年以后有灾，或老年积劳成疾，子息远离孤单
        
        2）大运流年和命局反吟
        大运、流年与年柱反吟：容易伤祖辈或者父母亲；重者，祖辈或者父母亲死亡；轻者，有伤病之灾难。这是因为年柱为祖上父母宫之故。
        大运、流年与月柱反吟：父母亲或者兄弟姐妹有灾，或者本人钱财有损。
        大运、流年与日柱反吟：本人或者配偶有灾，婚姻容易出现问题，注意身体、家庭、钱财之破损。
        大运、流年与时柱反吟：子息有灾，家中晚辈容易出现灾难病痛或者钱财损失。

        3）从十神等全方位看反吟
        印星反吟，必有母亲，工作学业上的事。
        财星反吟，必有妻子父亲，财钱方面的事。
        官杀反吟，必有工作身体官非之事。
        食伤反吟，必有心情、子女，工作与领导关系之事。
        比劫反吟，财钱、兄弟姊妹方面之事。
        天干反吟：事业财气方面的事。
        地支反吟，身体、六亲、病伤之事。
        用忌反吟，用神被反吟应凶，忌神被反吟应吉。
        宫位反吟，指宫位中的六亲吉凶及自己各个阶段身体事业方面的事
        


        \n` 
        /* 9.地支自刑      */
        JU = { Name:"地支自刑", Arr : ["辰辰","午午","酉酉","亥亥","丑戌","戌未","未丑","寅巳","巳申","申寅","子卯"] , 
        content :`
        巳酉丑三合金局，申酉戌三会金方局。所以巳刑申、酉酉自刑、丑戌刑； 寅午戌三合火局，巳午未三会火方局。所以寅刑巳、午午自刑、戌未刑； 亥卯未三合木局，亥子丑三会水方局。亥是北方水地，为木之长生之处，长生即成长的地方，落叶归根在此。东方震卦属木，水向东流不复归，水木同归一处，所以也自刑在此。即亥亥自刑，子卯相刑，丑未相刑。

        诸如上述，刑皆缘于自身，是合中生刑。这就像夫妻相合，尔后因爱生怨，反致刑伤，痛并快乐，像极了婚姻之现状。造化人事，命理即事理。


        子卯刑，为无礼之刑，字面意义上理解，就是没有礼貌，不懂礼数，面无和气，不太会察言观色。为何？因为子属水，卯属木，水能生木，水为母，木为子。母子相刑，乱了规矩，没有礼数。所以叫无礼之刑。

        寅巳申相刑最为复杂，这里的相刑将有相克、相生、 相合、相冲之意

        寅巳申，为无恩之刑。最简单的理解就是忘恩负义，吃水想不起挖井人，以怨报德。为何？因为寅中有甲，巳中有戊，戊为甲之偏财，偏财为父，子刑害父亲，财又是养命之源。去刑害养命之人，当然不知报恩，所以负义。巳申刑，申寅刑，都是一样的原因。

        丑戌未，为恃势之刑。字面意思，即为依仗权势。为何？丑中带水，为湿土，去刑戌这个火库干土，是丑依仗着水去刑火；而戌未刑，因为戌为乾卦，未为坤卦，天刑地，也是依仗自身优势欺负人；未刑丑，未中有土，刑丑中之水。所以这样的三刑，容易幸灾乐祸，不理它人感受，不会体谅他人等。

        三刑入命，多是不喜。毕竟这个刑在多数时候，都为害。刑，就是不顺。在论健康、婚姻、感情、六亲的时候，刑都不好，起坏作用。

        但在论事业的时候，刑在部分命例中，起到非常不错的作用，比如公检法军人职业，带刑；比如保险行业等，这些带煞气的行业和职业，如果从业者命中带刑，多是好事。因为把刑的特点，应在了职业上，对职业的发展有利。
        \n`  };
        rt += Mingx.Get地支查余支(Mingx,JU); 


        return rt;
    },
    callbacks: [
        (Mingx) => {
            let rt = Mingx.Get列出所有神煞(Mingx);
            console.log(rt);
        },   
        (Mingx) => { //循环四柱 大运 流年 交集各种情况
            Mingx.大运.forEach(y => {
                let 大运干支 = (Object.keys(y)).toString();
                let 大运干 = 大运干支.split('')[0];
                let 大运支 = 大运干支.split('')[1];
                let 大运起始流年 = (Object.values(y)).toString().split(',')[1];
                console.log(`${大运干支}运`);
                for (let i = 0; i < Mingx.流年.length; i++) {
                    let 流年干支 = (Object.keys(Mingx.流年[i])).toString();
                    let 流年干 = 流年干支.split('')[0];
                    let 流年支 = 流年干支.split('')[1];
                    let 流年年份 = (Object.values(Mingx.流年[i])).toString();
                    if ((parseInt(大运起始流年) + 10) > parseInt(流年年份) && parseInt(流年年份) >= parseInt(大运起始流年)) {//在大运中循环十年
                        let Ju1 = { JuName:"三合局", JuArr : ["寅午戌", "申子辰", "亥卯未", "巳酉丑"] };
                        let Ju2 = { JuName:"三会局", JuArr : ["寅卯辰", "巳午未", "申酉戌", "亥子丑"] };
                        let _三合局 = Mingx.Is合局(Mingx.四地支,大运支,流年支,Ju1);   //测试ok
                        let _三会局 = Mingx.Is合局(Mingx.四地支,大运支,流年支,Ju2);   //测试ok
                        let _天克地冲 = Mingx.Is天克地_冲(Mingx.四柱,大运干支,流年干支); //测试ok
                        console.log(`\t${流年年份}年(${流年年份-Mingx.birthYear}岁): ${流年干支} ${_天克地冲}${_三合局}${_三会局} ` );
                    };   
                };
            })
        }
    ]
};

/* 1. jarry */ 
// Ming.init(1978, "戊午,壬戌,庚戌,戊戌", "男", 8);
// Ming.init(1978, "戊午,壬戌,庚戌,戌亥", "男", 8);
// Ming.init(1978, "戊午,壬戌,庚戌,戌申", "男", 8);
// Ming.init(1978, "戊午,壬戌,壬子,戌申", "男", 8);

Ming.init(1978, "戊辰,癸卯,壬子,戌申", "男", 8);


/* 2. 七銀 */ 
// Ming.init(1993,"丙子,丙申,甲辰,戊辰","女",9); 

